In [2]:
#FILLNA-it is used for insert the values into the Data.

In [3]:
import pandas as pd

In [5]:
myfile1=pd.read_csv(r"C:\Users\tejas\A-DATA ANALYTICS\PANDAS\test.csv")
myfile1

     R1    R2    R3
0  10.0  20.0  30.0
1  11.0  21.0  31.0
2  12.0  22.0  32.0
3   NaN   NaN   NaN
4  16.0  13.0   NaN

In [6]:
myfile1.fillna('AB')

     R1    R2    R3
0  10.0  20.0  30.0
1  11.0  21.0  31.0
2  12.0  22.0  32.0
3    AB    AB    AB
4  16.0  13.0    AB

In [8]:
myfile1.fillna({"R3":"NULLDATA","R2":"Empty","R1":"0"})

     R1     R2        R3
0  10.0   20.0      30.0
1  11.0   21.0      31.0
2  12.0   22.0      32.0
3     0  Empty  NULLDATA
4  16.0   13.0  NULLDATA